<template>
  <div class="result">
    <h2 class="title_res">Мои результаты</h2>
    <p class="font-weight-medium mb-6">
      Вы завершили диагностику профессиональной компетентности педагога допрофессиональной подготовки. С помощью данного инструмента определялась сформированность когнитивного, деятельностного и личностного компонента компетентности.
    </p>
    <p>
      {{text}}
    </p>
    <ButtonMain text="Записаться к тьютору" type="second" class="ml-8"/>
  </div>
</template>

<script>


import ButtonMain from "@/components/ButtonMain";
export default {
  name: "MyResults",
  components: {ButtonMain},
  data: ()=>({
    text: `
    В когнитивном компоненте: обладание знаниями (пониманием) концепции и стратегии развития допрофессионального образования; необходимыми для реализации допрофессионального образования психологическими знаниями; обладание необходимыми для реализации допрофессионального образования знаниями в области педагогики и андрогогики.

В деятельностном компоненте: обладание технологические умениями проектирования и реализации учебного процесса ДППШ; обладание методическими умениями организации учебного процесса на основе подходов и принципов допрофессиональной педагогической подготовки; обладание коммуникативными умениями организации взаимодействия с участниками образовательных отношений ДППШ на основе сотрудничества и взаимопомощи; обладание рефлексивными умениями;

В личностном компоненте: обладание психологическими позициями, позволяющими в полной мере реализовать ценностно-смысловые основы и концептуальные идеи допрофессиональной педагогической подготовки; обладание личностными качествами педагога ДППШ.

С полученными рекомендациями Вы можете обратиться к тьютору, который поможет Вам составить индивидуальный план профессионального развития, выбрать необходимые образовательные мероприятия`
  })
}
</script>

<style scoped>
.result{
  text-align: center;
}

.title_res{
  font-size: 36px;
  font-weight: 500;
}
</style>